local MainStorage = game:GetService('MainStorage')
local gg = require(MainStorage.code.common.MGlobal) ---@type gg
local ItemType = require(MainStorage.code.common.config_type.ItemType) ---@type ItemType

--- 物品类型配置文件
---@class ItemTypeConfig
---@field Get fun(itemTypeId: string):ItemType 获取物品类型
---@field GetAll fun():ItemType[] 获取所有物品类型
local ItemTypeConfig = {}
local loaded = false
local function LoadConfig()
    ItemTypeConfig.config ={
    ["星星果碎片"] = ItemType.New({
        ["名字"] = "星星果碎片",
        ["品级"] = "传说",
        ["额外战力"] = 0,
        ["强化倍率"] = 0,
        ["强化材料增加倍率"] = 0,
        ["最大强化等级"] = 0,
        ["图鉴完成奖励数量"] = 0,
        ["图鉴高级完成奖励数量"] = 0,
        ["装备格子"] = 0,
        ["售出价格"] = 0,
        ["在背包里显示"] = true,
        ["是货币"] = false
    }),
    ["窝瓜碎片"] = ItemType.New({
        ["名字"] = "窝瓜碎片",
        ["品级"] = "传说",
        ["额外战力"] = 0,
        ["强化倍率"] = 0,
        ["强化材料增加倍率"] = 0,
        ["最大强化等级"] = 0,
        ["图鉴完成奖励数量"] = 0,
        ["图鉴高级完成奖励数量"] = 0,
        ["装备格子"] = 0,
        ["售出价格"] = 0,
        ["在背包里显示"] = true,
        ["是货币"] = false
    }),
    ["魅惑菇碎片"] = ItemType.New({
        ["名字"] = "魅惑菇碎片",
        ["品级"] = "传说",
        ["额外战力"] = 0,
        ["强化倍率"] = 0,
        ["强化材料增加倍率"] = 0,
        ["最大强化等级"] = 0,
        ["图鉴完成奖励数量"] = 0,
        ["图鉴高级完成奖励数量"] = 0,
        ["装备格子"] = 0,
        ["售出价格"] = 0,
        ["在背包里显示"] = true,
        ["是货币"] = false
    }),
    ["仙人掌碎片"] = ItemType.New({
        ["名字"] = "仙人掌碎片",
        ["品级"] = "史诗",
        ["额外战力"] = 0,
        ["强化倍率"] = 0,
        ["强化材料增加倍率"] = 0,
        ["最大强化等级"] = 0,
        ["图鉴完成奖励数量"] = 0,
        ["图鉴高级完成奖励数量"] = 0,
        ["装备格子"] = 0,
        ["售出价格"] = 0,
        ["在背包里显示"] = true,
        ["是货币"] = false
    }),
    ["火爆辣椒碎片"] = ItemType.New({
        ["名字"] = "火爆辣椒碎片",
        ["品级"] = "史诗",
        ["额外战力"] = 0,
        ["强化倍率"] = 0,
        ["强化材料增加倍率"] = 0,
        ["最大强化等级"] = 0,
        ["图鉴完成奖励数量"] = 0,
        ["图鉴高级完成奖励数量"] = 0,
        ["装备格子"] = 0,
        ["售出价格"] = 0,
        ["在背包里显示"] = true,
        ["是货币"] = false
    }),
    ["白菜拳手碎片"] = ItemType.New({
        ["名字"] = "白菜拳手碎片",
        ["品级"] = "史诗",
        ["额外战力"] = 0,
        ["强化倍率"] = 0,
        ["强化材料增加倍率"] = 0,
        ["最大强化等级"] = 0,
        ["图鉴完成奖励数量"] = 0,
        ["图鉴高级完成奖励数量"] = 0,
        ["装备格子"] = 0,
        ["售出价格"] = 0,
        ["在背包里显示"] = true,
        ["是货币"] = false
    }),
    ["辣椒投手碎片"] = ItemType.New({
        ["名字"] = "辣椒投手碎片",
        ["品级"] = "史诗",
        ["额外战力"] = 0,
        ["强化倍率"] = 0,
        ["强化材料增加倍率"] = 0,
        ["最大强化等级"] = 0,
        ["图鉴完成奖励数量"] = 0,
        ["图鉴高级完成奖励数量"] = 0,
        ["装备格子"] = 0,
        ["售出价格"] = 0,
        ["在背包里显示"] = true,
        ["是货币"] = false
    }),
    ["钢铁地刺碎片"] = ItemType.New({
        ["名字"] = "钢铁地刺碎片",
        ["品级"] = "史诗",
        ["额外战力"] = 0,
        ["强化倍率"] = 0,
        ["强化材料增加倍率"] = 0,
        ["最大强化等级"] = 0,
        ["图鉴完成奖励数量"] = 0,
        ["图鉴高级完成奖励数量"] = 0,
        ["装备格子"] = 0,
        ["售出价格"] = 0,
        ["在背包里显示"] = true,
        ["是货币"] = false
    }),
    ["地刺碎片"] = ItemType.New({
        ["名字"] = "地刺碎片",
        ["品级"] = "稀有",
        ["额外战力"] = 0,
        ["强化倍率"] = 0,
        ["强化材料增加倍率"] = 0,
        ["最大强化等级"] = 0,
        ["图鉴完成奖励数量"] = 0,
        ["图鉴高级完成奖励数量"] = 0,
        ["装备格子"] = 0,
        ["售出价格"] = 0,
        ["在背包里显示"] = true,
        ["是货币"] = false
    }),
    ["坚果碎片"] = ItemType.New({
        ["名字"] = "坚果碎片",
        ["品级"] = "稀有",
        ["额外战力"] = 0,
        ["强化倍率"] = 0,
        ["强化材料增加倍率"] = 0,
        ["最大强化等级"] = 0,
        ["图鉴完成奖励数量"] = 0,
        ["图鉴高级完成奖励数量"] = 0,
        ["装备格子"] = 0,
        ["售出价格"] = 0,
        ["在背包里显示"] = true,
        ["是货币"] = false
    }),
    ["椰子炮碎片"] = ItemType.New({
        ["名字"] = "椰子炮碎片",
        ["品级"] = "稀有",
        ["额外战力"] = 0,
        ["强化倍率"] = 0,
        ["强化材料增加倍率"] = 0,
        ["最大强化等级"] = 0,
        ["图鉴完成奖励数量"] = 0,
        ["图鉴高级完成奖励数量"] = 0,
        ["装备格子"] = 0,
        ["售出价格"] = 0,
        ["在背包里显示"] = true,
        ["是货币"] = false
    }),
    ["樱桃炸弹碎片"] = ItemType.New({
        ["名字"] = "樱桃炸弹碎片",
        ["品级"] = "稀有",
        ["额外战力"] = 0,
        ["强化倍率"] = 0,
        ["强化材料增加倍率"] = 0,
        ["最大强化等级"] = 0,
        ["图鉴完成奖励数量"] = 0,
        ["图鉴高级完成奖励数量"] = 0,
        ["装备格子"] = 0,
        ["售出价格"] = 0,
        ["在背包里显示"] = true,
        ["是货币"] = false
    }),
    ["豌豆射手碎片"] = ItemType.New({
        ["名字"] = "豌豆射手碎片",
        ["品级"] = "稀有",
        ["额外战力"] = 0,
        ["强化倍率"] = 0,
        ["强化材料增加倍率"] = 0,
        ["最大强化等级"] = 0,
        ["图鉴完成奖励数量"] = 0,
        ["图鉴高级完成奖励数量"] = 0,
        ["装备格子"] = 0,
        ["售出价格"] = 0,
        ["在背包里显示"] = true,
        ["是货币"] = false
    }),
    ["模板"] = ItemType.New({
        ["名字"] = "模板",
        ["描述"] = "aaaaaaaaaaaaaaaaaaa",
        ["额外战力"] = 800,
        ["强化倍率"] = 0,
        ["强化材料增加倍率"] = 0,
        ["最大强化等级"] = 0,
        ["属性"] = {
            ["攻击"] = 50
        },
        ["图鉴完成奖励数量"] = 0,
        ["图鉴高级完成奖励数量"] = 0,
        ["装备格子"] = 0,
        ["售出价格"] = 0,
        ["在背包里显示"] = true,
        ["是货币"] = false
    }),
    ["物品"] = ItemType.New({
        ["名字"] = "物品",
        ["描述"] = "aaaaaaaaaaaaaaaaaaa",
        ["品级"] = "传说",
        ["额外战力"] = 0,
        ["强化倍率"] = 0.1,
        ["强化素材"] = {
            ["物品"] = 20
        },
        ["强化材料增加倍率"] = 30,
        ["最大强化等级"] = 10,
        ["属性"] = {
            ["攻击"] = 50
        },
        ["标签"] = {
            "火焰"
        },
        ["图鉴完成奖励"] = "物品",
        ["图鉴完成奖励数量"] = 30,
        ["图鉴高级完成奖励数量"] = 80,
        ["装备格子"] = 1,
        ["可进阶为"] = "物品",
        ["进阶材料"] = {
            ["物品"] = 30
        },
        ["可售出为"] = "物品",
        ["售出价格"] = 50,
        ["在背包里显示"] = true,
        ["是货币"] = true,
        ["货币序号"] = 1,
        ["获得词条"] = {
            nil
        }
    }),
    ["水晶"] = ItemType.New({
        ["名字"] = "水晶",
        ["额外战力"] = 0,
        ["强化倍率"] = 0,
        ["强化材料增加倍率"] = 0,
        ["最大强化等级"] = 0,
        ["图鉴完成奖励数量"] = 0,
        ["图鉴高级完成奖励数量"] = 0,
        ["装备格子"] = 0,
        ["售出价格"] = 0,
        ["在背包里显示"] = true,
        ["是货币"] = true,
        ["货币序号"] = 3
    }),
    ["能量豆"] = ItemType.New({
        ["名字"] = "能量豆",
        ["额外战力"] = 0,
        ["强化倍率"] = 0,
        ["强化材料增加倍率"] = 0,
        ["最大强化等级"] = 0,
        ["图鉴完成奖励数量"] = 0,
        ["图鉴高级完成奖励数量"] = 0,
        ["装备格子"] = 0,
        ["售出价格"] = 0,
        ["在背包里显示"] = true,
        ["是货币"] = true,
        ["货币序号"] = 3
    }),
    ["金币"] = ItemType.New({
        ["名字"] = "金币",
        ["额外战力"] = 0,
        ["强化倍率"] = 0,
        ["强化材料增加倍率"] = 0,
        ["最大强化等级"] = 0,
        ["图鉴完成奖励数量"] = 0,
        ["图鉴高级完成奖励数量"] = 0,
        ["装备格子"] = 0,
        ["售出价格"] = 0,
        ["在背包里显示"] = true,
        ["是货币"] = true,
        ["货币序号"] = 1
    }),
    ["阳光"] = ItemType.New({
        ["名字"] = "阳光",
        ["额外战力"] = 0,
        ["强化倍率"] = 0,
        ["强化材料增加倍率"] = 0,
        ["最大强化等级"] = 0,
        ["图鉴完成奖励数量"] = 0,
        ["图鉴高级完成奖励数量"] = 0,
        ["装备格子"] = 0,
        ["售出价格"] = 0,
        ["在背包里显示"] = true,
        ["是货币"] = true,
        ["货币序号"] = 1
    })
}loaded = true
    gg.log("LoadConfig", ItemTypeConfig.config)
    loaded = true
end

---@param itemType string
---@return ItemType
function ItemTypeConfig.Get(itemType)
    if not loaded then
        LoadConfig()
    end
    return ItemTypeConfig.config[itemType]
end

---@return ItemType[]
function ItemTypeConfig.GetAll()
    if not loaded then
        LoadConfig()
    end
    return ItemTypeConfig.config
end

return ItemTypeConfig
