local MainStorage = game:GetService('MainStorage')
local gg                = require(MainStorage.code.common.MGlobal)    ---@type gg
local Modifiers      = require(MainStorage.code.common.config_type.modifier.Modifiers)    ---@type Modifiers
local Quest      = require(MainStorage.code.common.config_type.Quest)    ---@type Quest


--- 任务配置文件
---@class QuestConfig
local QuestConfig = {}
local loaded = false

local function LoadConfig()
    QuestConfig.config ={
    ["1教程任务——化身射手"] = Quest.New({
        ["名字"] = "1教程任务——化身射手",
        ["分类"] = "主线",
        ["简短描述"] = "击败3名僵尸",
        ["完整描述"] = "僵尸袭击花园了，快化身豌豆射手，消灭僵尸保护花园！",
        ["任务类型"] = "变量",
        ["完成数量"] = 3,
        ["显示完成进度"] = false,
        ["完成奖励"] = {
            ["金币"] = 100
        },
        ["自动领取下一任务"] = "2教程任务——阳光汲取",
        ["刷新类型"] = "不刷新"
    }),
    ["2教程任务——阳光汲取"] = Quest.New({
        ["名字"] = "2教程任务——阳光汲取",
        ["分类"] = "主线",
        ["简短描述"] = "这是挂机区域，在此区域内就能收获阳光！",
        ["任务类型"] = "物品",
        ["需求物品"] = "阳光",
        ["完成数量"] = 0,
        ["显示完成进度"] = false,
        ["自动领取下一任务"] = "3教程任务——主卡强化",
        ["刷新类型"] = "不刷新"
    }),
    ["3教程任务——主卡强化"] = Quest.New({
        ["名字"] = "3教程任务——主卡强化",
        ["分类"] = "主线",
        ["简短描述"] = "点击【主卡】对【豌豆射手】进行强化，变得更强！",
        ["任务类型"] = "变量",
        ["任务变量"] = "zhuka_level1",
        ["完成数量"] = 1,
        ["显示完成进度"] = false,
        ["完成奖励"] = {
            ["金币"] = 100
        },
        ["自动领取下一任务"] = "4教程任务——艺术就是爆炸！",
        ["刷新类型"] = "不刷新"
    }),
    ["4教程任务——艺术就是爆炸！"] = Quest.New({
        ["名字"] = "4教程任务——艺术就是爆炸！",
        ["分类"] = "主线",
        ["简短描述"] = "点击【副卡】，看看【樱桃炸弹】的技能效果吧。",
        ["完整描述"] = "获得战术副卡！副卡可以在战斗中为我们提供额外效果，点击查看卡牌效果吧！",
        ["任务类型"] = "变量",
        ["任务变量"] = "初次点击副卡界面",
        ["完成数量"] = 0,
        ["显示完成进度"] = false,
        ["完成奖励"] = {
            ["金币"] = 100
        },
        ["完成指令"] = "skill {\"技能名\":\"副-樱桃炸弹\"}",
        ["自动领取下一任务"] = "7教程任务——幸运十连",
        ["刷新类型"] = "不刷新"
    }),
    ["6教程任务——副卡强化"] = Quest.New({
        ["名字"] = "6教程任务——副卡强化",
        ["分类"] = "主线",
        ["简短描述"] = "点击【副卡】，选择心仪的副卡进行升级强化吧！",
        ["完整描述"] = "阳光还可用于升级副卡，增强战斗力！",
        ["任务类型"] = "变量",
        ["任务变量"] = "第一次升级副卡",
        ["完成数量"] = 1,
        ["显示完成进度"] = false,
        ["完成奖励"] = {
            ["金币"] = 100
        },
        ["自动领取下一任务"] = nil,
        ["刷新类型"] = "不刷新"
    }),
    ["7教程任务——幸运十连"] = Quest.New({
        ["名字"] = "7教程任务——幸运十连",
        ["分类"] = "主线",
        ["简短描述"] = "进行一次副卡十连抽",
        ["完整描述"] = "点击副卡奖池，抽取更多强力副卡吧！",
        ["任务类型"] = "事件",
        ["事件名"] = "进行任务副卡十连抽",
        ["完成数量"] = 1,
        ["显示完成进度"] = false,
        ["完成奖励"] = {
            ["金币"] = 100
        },
        ["自动领取下一任务"] = "6教程任务——副卡强化",
        ["刷新类型"] = "不刷新"
    }),
    ["测试任务"] = Quest.New({
        ["名字"] = "测试任务",
        ["分类"] = "主线",
        ["简短描述"] = "任务任务任务",
        ["完整描述"] = "任务完整描述",
        ["任务类型"] = "无类型",
        ["完成数量"] = 5,
        ["显示完成进度"] = true,
        ["前往场景节点"] = "g0/NPC/铁匠铺",
        ["自动领取下一任务"] = nil,
        ["刷新类型"] = "不刷新"
    }),
    ["1完成关卡1-1"] = Quest.New({
        ["名字"] = "1完成关卡1-1",
        ["分类"] = "主线",
        ["简短描述"] = "完成关卡：1-1",
        ["任务类型"] = "变量",
        ["任务变量"] = "level_1-1",
        ["完成数量"] = 1,
        ["显示完成进度"] = false,
        ["自动领取下一任务"] = "2抽卡",
        ["刷新类型"] = "不刷新"
    }),
    ["2抽卡"] = Quest.New({
        ["名字"] = "2抽卡",
        ["分类"] = "主线",
        ["简短描述"] = "在【试手寻锋】中获取五把兵刃",
        ["任务类型"] = "变量",
        ["任务变量"] = "draw_试手寻锋",
        ["完成数量"] = 5,
        ["显示完成进度"] = false,
        ["自动领取下一任务"] = "3装备兵刃",
        ["刷新类型"] = "不刷新"
    }),
    ["3装备兵刃"] = Quest.New({
        ["名字"] = "3装备兵刃",
        ["分类"] = "主线",
        ["简短描述"] = "装备新获得的兵刃",
        ["任务类型"] = "变量",
        ["任务变量"] = "equipped",
        ["完成数量"] = 1,
        ["显示完成进度"] = false,
        ["自动领取下一任务"] = "4完成关卡1-2",
        ["刷新类型"] = "不刷新"
    }),
    ["4完成关卡1-2"] = Quest.New({
        ["名字"] = "4完成关卡1-2",
        ["分类"] = "主线",
        ["简短描述"] = "完成关卡：1-2",
        ["任务类型"] = "变量",
        ["任务变量"] = "level_1-2",
        ["完成数量"] = 1,
        ["显示完成进度"] = false,
        ["自动领取下一任务"] = "5强化护甲",
        ["刷新类型"] = "不刷新"
    }),
    ["5强化护甲"] = Quest.New({
        ["名字"] = "5强化护甲",
        ["分类"] = "主线",
        ["简短描述"] = "将护甲全部强化到+1",
        ["任务类型"] = "变量",
        ["任务变量"] = "enhanced_1_1",
        ["完成数量"] = 6,
        ["显示完成进度"] = false,
        ["自动领取下一任务"] = "6完成关卡1-3",
        ["刷新类型"] = "不刷新"
    }),
    ["6完成关卡1-3"] = Quest.New({
        ["名字"] = "6完成关卡1-3",
        ["分类"] = "主线",
        ["简短描述"] = "完成关卡：1-3",
        ["任务类型"] = "变量",
        ["任务变量"] = "level_1-3",
        ["完成数量"] = 1,
        ["显示完成进度"] = false,
        ["自动领取下一任务"] = "7装备宝石",
        ["刷新类型"] = "不刷新"
    }),
    ["7装备宝石"] = Quest.New({
        ["名字"] = "7装备宝石",
        ["分类"] = "主线",
        ["简短描述"] = "装备3个宝石",
        ["任务类型"] = "变量",
        ["任务变量"] = "equip_jade",
        ["完成数量"] = 3,
        ["显示完成进度"] = false,
        ["自动领取下一任务"] = "8完成关卡1-4",
        ["刷新类型"] = "不刷新"
    }),
    ["8完成关卡1-4"] = Quest.New({
        ["名字"] = "8完成关卡1-4",
        ["分类"] = "主线",
        ["简短描述"] = "完成关卡：1-4",
        ["任务类型"] = "变量",
        ["任务变量"] = "level_1-4",
        ["完成数量"] = 1,
        ["显示完成进度"] = false,
        ["自动领取下一任务"] = "9强化护甲",
        ["刷新类型"] = "不刷新"
    }),
    ["9强化护甲"] = Quest.New({
        ["名字"] = "9强化护甲",
        ["分类"] = "主线",
        ["简短描述"] = "将护甲全部强化到+3",
        ["任务类型"] = "变量",
        ["任务变量"] = "enhanced_1_3",
        ["完成数量"] = 6,
        ["显示完成进度"] = false,
        ["自动领取下一任务"] = "10完成关卡1-5",
        ["刷新类型"] = "不刷新"
    }),
    ["10完成关卡1-5"] = Quest.New({
        ["名字"] = "10完成关卡1-5",
        ["分类"] = "主线",
        ["简短描述"] = "完成关卡：1-5",
        ["任务类型"] = "变量",
        ["任务变量"] = "level_1-5",
        ["完成数量"] = 1,
        ["显示完成进度"] = false,
        ["自动领取下一任务"] = "11抽卡15",
        ["刷新类型"] = "不刷新"
    }),
    ["11完成关卡1-1"] = Quest.New({
        ["名字"] = "11完成关卡1-1",
        ["分类"] = "主线",
        ["任务类型"] = "无类型",
        ["完成数量"] = 0,
        ["显示完成进度"] = true,
        ["自动领取下一任务"] = nil,
        ["刷新类型"] = "不刷新"
    }),
    ["11抽卡15"] = Quest.New({
        ["名字"] = "11抽卡15",
        ["分类"] = "主线",
        ["简短描述"] = "累计【试手寻锋】获取15次兵刃",
        ["任务类型"] = "变量",
        ["任务变量"] = "draw_试手寻锋",
        ["完成数量"] = 15,
        ["显示完成进度"] = false,
        ["自动领取下一任务"] = "12强化兵刃",
        ["刷新类型"] = "不刷新"
    }),
    ["12强化兵刃"] = Quest.New({
        ["名字"] = "12强化兵刃",
        ["分类"] = "主线",
        ["简短描述"] = "强化任意兵刃",
        ["任务类型"] = "变量",
        ["任务变量"] = "weapon_enhanced",
        ["完成数量"] = 1,
        ["显示完成进度"] = false,
        ["自动领取下一任务"] = "13完成关卡1-6",
        ["刷新类型"] = "不刷新"
    }),
    ["13完成关卡1-6"] = Quest.New({
        ["名字"] = "13完成关卡1-6",
        ["分类"] = "主线",
        ["简短描述"] = "完成关卡：1-6",
        ["任务类型"] = "变量",
        ["任务变量"] = "level_1-6",
        ["完成数量"] = 1,
        ["显示完成进度"] = true,
        ["自动领取下一任务"] = "14强化护甲",
        ["刷新类型"] = "不刷新"
    }),
    ["14强化护甲"] = Quest.New({
        ["名字"] = "14强化护甲",
        ["分类"] = "主线",
        ["简短描述"] = "将护甲全部强化到+5",
        ["任务类型"] = "变量",
        ["任务变量"] = "enhanced_1_5",
        ["完成数量"] = 6,
        ["显示完成进度"] = false,
        ["自动领取下一任务"] = "15进阶护甲",
        ["刷新类型"] = "不刷新"
    }),
    ["15进阶护甲"] = Quest.New({
        ["名字"] = "15进阶护甲",
        ["分类"] = "主线",
        ["简短描述"] = "将护甲全部进阶",
        ["任务类型"] = "变量",
        ["任务变量"] = "breakthrough_1",
        ["完成数量"] = 6,
        ["显示完成进度"] = false,
        ["自动领取下一任务"] = "16装备宝石",
        ["刷新类型"] = "不刷新"
    }),
    ["16装备宝石"] = Quest.New({
        ["名字"] = "16装备宝石",
        ["分类"] = "主线",
        ["简短描述"] = "总计装备12个宝石",
        ["任务类型"] = "变量",
        ["任务变量"] = "equip_jade",
        ["完成数量"] = 12,
        ["显示完成进度"] = false,
        ["自动领取下一任务"] = "17每日关卡",
        ["刷新类型"] = "不刷新"
    }),
    ["17每日关卡"] = Quest.New({
        ["名字"] = "17每日关卡",
        ["分类"] = "主线",
        ["简短描述"] = "完成每日挑战",
        ["任务类型"] = "变量",
        ["任务变量"] = "level_mr1",
        ["完成数量"] = 1,
        ["显示完成进度"] = true,
        ["完成奖励"] = {
            [""] = 300
        },
        ["自动领取下一任务"] = "18完成关卡2-3",
        ["刷新类型"] = "不刷新"
    }),
    ["18完成关卡2-3"] = Quest.New({
        ["名字"] = "18完成关卡2-3",
        ["分类"] = "主线",
        ["简短描述"] = "完成关卡：2-3",
        ["任务类型"] = "变量",
        ["任务变量"] = "level_2-3",
        ["完成数量"] = 1,
        ["显示完成进度"] = false,
        ["自动领取下一任务"] = "19抽卡5",
        ["刷新类型"] = "不刷新"
    }),
    ["19抽卡5"] = Quest.New({
        ["名字"] = "19抽卡5",
        ["分类"] = "主线",
        ["简短描述"] = "在【神锋现世】中获取10把兵刃",
        ["任务类型"] = "变量",
        ["任务变量"] = "draw_神锋现世",
        ["完成数量"] = 10,
        ["显示完成进度"] = true,
        ["完成奖励"] = {
            [""] = 3000
        },
        ["自动领取下一任务"] = "20强化紫武",
        ["刷新类型"] = "不刷新"
    }),
    ["20强化紫武"] = Quest.New({
        ["名字"] = "20强化紫武",
        ["分类"] = "主线",
        ["简短描述"] = "累计将紫色兵刃强化两次",
        ["任务类型"] = "变量",
        ["任务变量"] = "weapon_史诗",
        ["完成数量"] = 2,
        ["显示完成进度"] = false,
        ["自动领取下一任务"] = "21完成关卡2-5",
        ["刷新类型"] = "不刷新"
    }),
    ["21完成关卡2-5"] = Quest.New({
        ["名字"] = "21完成关卡2-5",
        ["分类"] = "主线",
        ["简短描述"] = "完成关卡：2-5",
        ["任务类型"] = "变量",
        ["任务变量"] = "level_2-5",
        ["完成数量"] = 1,
        ["显示完成进度"] = false,
        ["自动领取下一任务"] = "22强化护甲",
        ["刷新类型"] = "不刷新"
    }),
    ["22强化护甲"] = Quest.New({
        ["名字"] = "22强化护甲",
        ["分类"] = "主线",
        ["简短描述"] = "将护甲全部强化到+5",
        ["任务类型"] = "变量",
        ["任务变量"] = "enhanced_2_5",
        ["完成数量"] = 6,
        ["显示完成进度"] = false,
        ["自动领取下一任务"] = "23完成困难关卡",
        ["刷新类型"] = "不刷新"
    }),
    ["23完成困难关卡"] = Quest.New({
        ["名字"] = "23完成困难关卡",
        ["分类"] = "主线",
        ["简短描述"] = "完成第一大关的全部困难模式",
        ["任务类型"] = "变量",
        ["任务变量"] = "level_hard_1",
        ["完成数量"] = 6,
        ["显示完成进度"] = true,
        ["完成奖励"] = {
            [""] = 1000
        },
        ["自动领取下一任务"] = "24进阶护甲",
        ["刷新类型"] = "不刷新"
    }),
    ["24进阶护甲"] = Quest.New({
        ["名字"] = "24进阶护甲",
        ["分类"] = "主线",
        ["简短描述"] = "将护甲全部进阶",
        ["任务类型"] = "变量",
        ["任务变量"] = "breakthrough_2",
        ["完成数量"] = 6,
        ["显示完成进度"] = true,
        ["完成奖励"] = {
            [""] = 500
        },
        ["自动领取下一任务"] = "25完成关卡2-6",
        ["刷新类型"] = "不刷新"
    }),
    ["25完成关卡2-6"] = Quest.New({
        ["名字"] = "25完成关卡2-6",
        ["分类"] = "主线",
        ["简短描述"] = "完成关卡：2-6",
        ["任务类型"] = "变量",
        ["任务变量"] = "level_2-6",
        ["完成数量"] = 1,
        ["显示完成进度"] = true,
        ["完成奖励"] = {
            [""] = 1001
        },
        ["自动领取下一任务"] = nil,
        ["刷新类型"] = "不刷新"
    }),
    ["周常任务1"] = Quest.New({
        ["名字"] = "周常任务1",
        ["分类"] = "每周",
        ["简短描述"] = "登录游戏",
        ["完整描述"] = "1",
        ["任务类型"] = "无类型",
        ["完成数量"] = 0,
        ["显示完成进度"] = true,
        ["完成奖励"] = {
            [""] = 10
        },
        ["自动领取下一任务"] = nil,
        ["刷新类型"] = "每周",
        ["刷新时自动领取"] = true
    }),
    ["周常任务2"] = Quest.New({
        ["名字"] = "周常任务2",
        ["分类"] = "每周",
        ["简短描述"] = "完成任意关卡",
        ["任务类型"] = "变量",
        ["任务变量"] = "daily_clear_level",
        ["完成数量"] = 5,
        ["显示完成进度"] = true,
        ["完成奖励"] = {
            [""] = 10
        },
        ["自动领取下一任务"] = nil,
        ["刷新类型"] = "每周",
        ["刷新时自动领取"] = true
    }),
    ["周常任务3"] = Quest.New({
        ["名字"] = "周常任务3",
        ["分类"] = "每周",
        ["简短描述"] = "击败5000个怪物",
        ["任务类型"] = "变量",
        ["任务变量"] = "daily_kill_mob",
        ["完成数量"] = 5000,
        ["显示完成进度"] = true,
        ["完成奖励"] = {
            [""] = 10
        },
        ["自动领取下一任务"] = nil,
        ["刷新类型"] = "每周",
        ["刷新时自动领取"] = true
    }),
    ["成就任务1"] = Quest.New({
        ["名字"] = "成就任务1",
        ["分类"] = "成就",
        ["简短描述"] = "登录游戏",
        ["完整描述"] = "1",
        ["任务类型"] = "无类型",
        ["完成数量"] = 0,
        ["显示完成进度"] = true,
        ["完成奖励"] = {
            [""] = 10
        },
        ["自动领取下一任务"] = nil,
        ["刷新类型"] = "不刷新"
    }),
    ["成就任务2"] = Quest.New({
        ["名字"] = "成就任务2",
        ["分类"] = "成就",
        ["简短描述"] = "完成任意关卡",
        ["任务类型"] = "变量",
        ["任务变量"] = "daily_clear_level",
        ["完成数量"] = 5,
        ["显示完成进度"] = true,
        ["完成奖励"] = {
            [""] = 10
        },
        ["自动领取下一任务"] = nil,
        ["刷新类型"] = "不刷新"
    }),
    ["成就任务3"] = Quest.New({
        ["名字"] = "成就任务3",
        ["分类"] = "成就",
        ["简短描述"] = "击败5000个怪物",
        ["任务类型"] = "变量",
        ["任务变量"] = "daily_kill_mob",
        ["完成数量"] = 5000,
        ["显示完成进度"] = true,
        ["完成奖励"] = {
            [""] = 10
        },
        ["自动领取下一任务"] = nil,
        ["刷新类型"] = "不刷新"
    }),
    ["每日任务1"] = Quest.New({
        ["名字"] = "每日任务1",
        ["分类"] = "每日",
        ["简短描述"] = "登录游戏",
        ["任务类型"] = "无类型",
        ["完成数量"] = 0,
        ["显示完成进度"] = true,
        ["完成奖励"] = {
            [""] = 10
        },
        ["自动领取下一任务"] = nil,
        ["刷新类型"] = "每日",
        ["刷新时自动领取"] = true
    }),
    ["每日任务2"] = Quest.New({
        ["名字"] = "每日任务2",
        ["分类"] = "每日",
        ["简短描述"] = "完成任意关卡",
        ["任务类型"] = "变量",
        ["任务变量"] = "daily_clear_level",
        ["完成数量"] = 0,
        ["显示完成进度"] = true,
        ["完成奖励"] = {
            [""] = 10
        },
        ["自动领取下一任务"] = nil,
        ["刷新类型"] = "每日",
        ["刷新时自动领取"] = true
    }),
    ["每日任务3"] = Quest.New({
        ["名字"] = "每日任务3",
        ["分类"] = "每日",
        ["简短描述"] = "击败5000个怪物",
        ["任务类型"] = "变量",
        ["任务变量"] = "daily_kill_mob",
        ["完成数量"] = 5000,
        ["显示完成进度"] = true,
        ["完成奖励"] = {
            [""] = 10
        },
        ["自动领取下一任务"] = nil,
        ["刷新类型"] = "每日",
        ["刷新时自动领取"] = true
    })
}loaded = true
end

---@param questName string
---@return Quest
function QuestConfig.Get(questName)
    if not loaded then
        LoadConfig()
    end
    return QuestConfig.config[questName]
end

---@return Quest[]
function QuestConfig.GetAll()
    if not loaded then
        LoadConfig()
    end
    return QuestConfig.config
end
return QuestConfig
